In [10]:
import pandas as pd

In [11]:
# 1. Create a Pandas Series using a list of 5 random numbers and custom index names.
#     Then print the series and its data type.

data = [1, 2, 3, 4, 5]

series = pd.Series(data, index = ["A", "B", "C", "D", "E"])
print(series)

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [12]:
# 2. Create a DataFrame with columns: "Student_Name", "Maths", "Science", "English".
#     Fill it with 5 sample student records and display the top 3 rows using head().

data_dict = {
    "Name" : ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Maths" : [80, 45, 25 , 77, 89],
    "Science" : [79, 86, 70, 49, 95],
    "English" : [59, 83, 75, 49, 35]
}
df = pd.DataFrame(data_dict)
print(df.head(3))

      Name  Maths  Science  English
0    Alice     80       79       59
1      Bob     45       86       83
2  Charlie     25       70       75

In [13]:
# 3. Import a CSV file (use any sample dataset) into a DataFrame.
#     Display the number of rows and columns using shape, and print column names.

df1 = pd.read_csv(r"C:\Users\harsh\OneDrive\Desktop\Python\Basics\Eduplus\ML\Pandas\Assignment\feature_engineering_data.csv")
print(df1.shape)
print(df1.columns)

(10962, 14)
Index(['Date', 'Region', 'Service', 'Daily_Usage_Units', 'Peak_Usage_Units',
       'VM_Count', 'Storage_TB', 'Season', 'Econ_Index', 'Downtime_Min',
       'Usage_Lag_1', 'Usage_Lag_7', 'Week_Over_Week_Growth',
       'Seasonality_Factor'],
      dtype='object')

In [19]:
# 4. Add a new column named "Total_Marks" that sums all three subject scores.
#     Then create another column "Average" by dividing Total_Marks by 3.
df['Total_Marks'] = df['Maths'] + df['Science'] + df['English']
df['Average_marks'] = df['Total_Marks'] / 3
print(df)

      Name  Maths  Science  English  Total_Marks  Average_marks
0    Alice     80       79       59          218      72.666667
1      Bob     45       86       83          214      71.333333
2  Charlie     25       70       75          170      56.666667
3    David     77       49       49          175      58.333333
4      Eva     89       95       35          219      73.000000

In [20]:
# 5. Introduce a missing value (NaN) in the "Science" column and then:
#     (a) Identify missing values using isnull()
#     (b) Replace the missing value with the column mean using fillna().
df.loc[2, 'Science'] = None

df.isnull()

    Name  Maths  Science  English  Total_Marks  Average_marks
0  False  False    False    False        False          False
1  False  False    False    False        False          False
2  False  False     True    False        False          False
3  False  False    False    False        False          False
4  False  False    False    False        False          False

In [22]:
df.fillna(df['Science'].mean(), inplace = True)
print(df)

      Name  Maths  Science  English  Total_Marks  Average_marks
0    Alice     80    79.00       59          218      72.666667
1      Bob     45    86.00       83          214      71.333333
2  Charlie     25    77.25       75          170      56.666667
3    David     77    49.00       49          175      58.333333
4      Eva     89    95.00       35          219      73.000000

In [34]:
# 6. Filter and display all students whose "Average" score is greater than 75.
df[df["Average_marks"] > 70][["Name", "Average_marks"]]

    Name  Average_marks
0  Alice      72.666667
1    Bob      71.333333
4    Eva      73.000000

In [35]:
# 7. Sort the DataFrame by "Total_Marks" in descending order and show the top 3 performers.

print(df.sort_values(by = 'Total_Marks', ascending = False).head(3))

    Name  Maths  Science  English  Total_Marks  Average_marks
4    Eva     89     95.0       35          219      73.000000
0  Alice     80     79.0       59          218      72.666667
1    Bob     45     86.0       83          214      71.333333